// -------------------------------------------------------------
// กำหนดขาสำหรับ VR (Potentiometer)
// -------------------------------------------------------------
int VR_PIN = 35;  // ขา ADC สำหรับอ่านค่า VR

// -------------------------------------------------------------
void setup()
{
    Serial.begin(115200); // เปิด Serial Monitor สำหรับดูค่า VR
}

void loop()
{
    // อ่านค่าแรงดันจาก VR (0–4095 สำหรับ ESP32 ADC 12-bit)
    int vr = analogRead(VR_PIN);

    // แสดงผลบน Serial Monitor
    Serial.print("VR =");
    Serial.println(vr);

    delay(50); // อ่านค่าใหม่ทุก 50 ms
}
