/* ST-LAB (ESP32) - Example Code
 LAB07 : I2C LCD 0x27
*/
#include <Wire.h> // ไลบรารีสำหรับสื่อสารแบบ I2C
#include <LiquidCrystal_I2C.h> // ไลบรารีควบคุมจอ LCD แบบ I2C

#define I2C_SDA 21 // กำหนดขา GPIO21 เป็น SDA (ข้อมูล I2C)
#define I2C_SCL 22 // กำหนดขา GPIO22 เป็น SCL (สัญญาณ Clock I2C)
#define LCD_ADDR 0x27 // กำหนดที่อยู่ I2C ของจอ LCD (ปกติคือ 0x27 หรือ 0x3F)
LiquidCrystal_I2C lcd(LCD_ADDR, 16, 2); // สร้างออบเจ็กต์ lcd สำหรับจอขนาด 16 คอลัมน์ 2 แถว

void setup()
{ // ทำงานครั้งเดียวเมื่อเปิดเครื่องหรือรีเซตบอร์ด
Wire.begin(I2C_SDA, I2C_SCL); // เริ่มต้นบัส I2C โดยกำหนดขา SDA และ SCL
lcd.init(); // เริ่มต้นการทำงานของจอ LCD
lcd.backlight(); // เปิดไฟ Backlight ของจอ LCD
lcd.setCursor(0, 0); // ตั้งตำแหน่งเคอร์เซอร์ที่คอลัมน์ 0 แถว 0
lcd.print("ST-LAB v2.0"); // แสดงข้อความบรรทัดแรก
lcd.setCursor(0, 1); // ตั้งตำแหน่งเคอร์เซอร์ที่คอลัมน์ 0 แถว 1
lcd.print("I2C LCD 0x27"); // แสดงข้อความบรรทัดที่สอง
} // จบฟังก์ชัน setup()

void loop()
{ // ทำงานวนซ้ำตลอดเวลาที่บอร์ดยังทำงานอยู่
static int n = 0; // ตัวแปรนับค่า (เก็บค่าไว้แม้ออกจากฟังก์ชัน)
lcd.setCursor(14, 1); // ย้ายเคอร์เซอร์ไปตำแหน่งคอลัมน์ที่ 14 แถวที่ 1
lcd.print((n / 10) % 10); // แสดงหลักสิบของตัวเลข n
lcd.print(n % 10); // แสดงหลักหน่วยของตัวเลข n
n = (n + 1) % 100; // เพิ่มค่า n ทีละ 1 และวนกลับเมื่อครบ 100 (0–99)
delay(250); // หน่วงเวลา 250 ms ก่อนอัปเดตค่าครั้งถัดไป
} // จบฟังก์ชัน loop()